/*eslint-env node, mocha */
/*global expect */
/*eslint no-console: 0*/
'use-strict';

import { lyricParser } from '../../src/utils';

describe('Utils: lyricParser', () => {

	beforeEach(function() {
		this.normalLyric = '[00:27.540]Ah! ほのかな予感から始まり\n[00:32.970]Ah! 希望が星空駈けて\n[00:38.450]花を咲かせるにっこり笑顔は\n[00:43.920]ずっと同じさ 友情の笑顔\n[00:49.160]\n[00:49.510]忘れない いつまでも忘れない\n[00:54.940]こんなにも心がひとつになる\n[01:00.410]世界を見つけた喜び(ともに)歌おう\n[01:09.940]最後まで(僕たちはひとつ)\n[01:16.660]\n[01:17.040]小鳥の翼がついに大きくなって\n[01:25.010]旅立ちの日だよ\n[01:28.130]遠くへと広がる海の色暖かく\n[01:36.050]夢の中で描いた絵のようなんだ\n[01:40.300]切なくて時をまきもどしてみるかい?\n[01:52.490]No no no いまが最高!\n[01:58.620]\n[02:20.460]みんなと出会えたこと嬉しくて\n[02:27.090]離れたくないよ本当だよ\n[02:31.550]涙はいらない このまま踊ろう\n[02:36.980]手を振ってもっと振って\n[02:42.890]\n[02:45.370]光を追いかけてきた僕たちだから\n[02:53.190]さよならは言わない\n[02:56.320]また会おう 呼んでくれるかい?\n[03:00.300]僕たちのこと\n[03:04.320]素敵だった未来に繋がった夢\n[03:08.560]夢の未来 君と僕のLIVE&LIFE\n[03:15.430]\n[03:37.800]小鳥の翼がついに大きくなって\n[03:45.640]旅立ちの日だよ\n[03:48.760]遠くへと広がる海の色暖かく\n[03:56.730]夢の中で描いた絵のようなんだ\n[04:00.990]切なくて時をまきもどしてみるかい?\n[04:13.240]No no no いまが最高!\n[04:18.670]だってだって、いまが最高!\n[04:30.500]\n[04:31.520]Ah! ほのかな予感から始まり\n[04:37.410]Ah! 光を追いかけてきたんだよ…\n[04:48.410]';
		this.simplifiedLyric = '[by:KusunokiAsuha]\n[00:00.00] 作曲 : 藤田淳平\n[00:01.00] 作词 : 中村航\n[00:06.66][00:45.09][00:56.55][01:16.01][01:27.13][01:45.34][02:06.70][02:18.46][02:37.21][03:24.31][03:36.24][03:54.24][04:20.94]\n[00:35.18]ありったけの思い 胸に秘めて\n[00:40.50]いつしか季節は変わっていく\n[00:46.30]遠い夢 見あげていた (blue sky)\n[00:50.89]あの空へいつか行こう\n[00:57.94]いま growing 芽がでて\n[01:01.27]blooming 膨らみ\n[01:04.09]誰より大きな花を 咲かせたら\n[01:09.70]キミに夏を知らせたい (shining)\n[01:16.20][03:24.68]両手をひろげて\n[01:18.51][03:27.40]高く 強く 熱く 遠く\n[01:21.52]でも (けど) たぶん まだ届かないみたい\n[01:27.31][03:36.39]高く 強く 熱く 遠く (遠く！)\n[01:30.40][03:39.33]まぶしすぎる光を もっと (もっと！)\n[01:33.60][03:42.16]あつめて ゆっくり背伸びしている\n[01:39.08][03:47.80]明日を夢見る ひまわりのように\n[01:57.13]精一杯の夢 握りしめて\n[02:02.52]今日も太陽を追いかけてる\n[02:08.21]君が隣にいるから (no fear)\n[02:12.85]ふがいなさ許せたんだ\n[02:19.87]いま wake up 目覚めて\n[02:23.01]start up 飛びだし\n[02:26.13]風に身をまかせ 旅をはじめよう\n[02:31.57]キミと夏を探したい\n[03:01.51]かなしかった日もあったよね\n[03:07.24]振り向かず 前向いて走る！\n[03:13.21]うれしかった日があったよね\n[03:18.87]溶けだした 未来――\n[03:30.29]でも (けど) たぶん まだ伝えきれないな\n[03:56.61](愛と勇気！) ハート doki! doki!\n[04:02.59](届けたいな) キミと happy! happy!\n[04:08.20](見つけだして！) sunflower! smiling!\n[04:14.19](忘れないよ！) キミと出会えた季節――\n';
		this.normalTranslation = 'Ah! 从微小的预感开始\nAh! 希冀在星空中驰骋\n笑开花儿的真切笑容是\n亘久不变 友情的笑容\n\n无法忘却 永远铭记\n心灵能如此合而为一\n让我们（一同）歌唱发现世界的喜悦\n直到最后（我们已成为一体）\n\n小鸟终也羽翼丰满\n到了展翅翱翔的日子\n一望无垠的大海 颜色是如此温暖\n如同在梦中描绘的画\n若感到惆怅要让时光倒流吗？\nNo no no 此刻就是最好的！\n\n与大家相遇是如此幸福\n不舍别离 真的\n不必流泪 就此起舞吧\n挥舞起手 用力挥舞吧\n\n因为我们已经追上了那束光芒\n所以不需要道别\n再会之时 能否轻唤\n我们的名字？\n通往美好未来的梦想\n梦想的未来 属于你与我的LIVE&LIFE\n\n小鸟终也羽翼丰满\n到了展翅翱翔的日子\n一望无垠的大海 颜色是如此温暖\n如同在梦中描绘的画\n若感到惆怅要让时光倒流吗？\nNo no no 此刻就是最好的！\n因为因为，此刻就是最好的！\n\nAh! 从微小的预感开始\nAh! 追逐到了那束光芒……';
		this.timelinedTranslation = '[by:ashuuuuuuu]\n[00:35.18]将所有的思绪 藏于心中\n[00:40.50]不知不觉季节已流转变换\n[00:46.30]曾抬头仰望的梦想（blue sky）\n[00:50.89]总有一天要去往那片天空\n[00:57.94]如今（growing）生根发芽\n[01:01.27]（blooming）茁壮成长\n[01:04.09]若能成为盛开得最为灿烂的花朵\n[01:09.70]想要以此向你传达这份夏意（shining）\n[01:16.20]敞开双臂拥抱\n[01:18.51]这份高扬 强烈 炽热 悠远的阳光吧\n[01:21.52]尽管似乎还没有能好好传达\n[01:27.31]在心中更多地感受\n[01:30.40]这份高扬 强烈 炽热 悠远而炫目的阳光\n[01:33.60]放松身心 好好享受这份夏意\n[01:39.08]将明日当作那梦想中的向日葵吧\n[01:57.13]紧握着竭尽全力为之努力的梦想\n[02:02.52]今天也追逐着光芒前行\n[02:08.21]因为你在身旁（no fear）\n[02:12.85]原谅了我的不争气\n[02:19.87]如今（wake up）睁开双眼\n[02:23.01]（start up）展翅飞翔\n[02:26.13]随风前行 开始旅途\n[02:31.57]想要与你寻找夏日的气息\n[03:01.51]也曾有过悲伤的日子\n[03:07.24]仍然不回首地向前奔跑\n[03:13.21]也曾有过快乐的日子\n[03:18.87]将这份快乐转化为向未来前进的动力吧\n[03:24.68]敞开双臂拥抱\n[03:27.40]这份高扬 强烈 炽热 悠远的阳光吧\n[03:30.29]尽管似乎还没有能好好传达\n[03:36.39]在心中更多地感受\n[03:39.33]这份高扬 强烈 炽热 悠远而炫目的阳光\n[03:42.16]放松身心 好好享受这份夏意\n[03:47.80]将明日当作那梦想中的向日葵吧\n[03:56.61]（爱与勇气）心在doki！doki！\n[04:02.59]（想要传达）与你happy！happy！\n[04:08.20]（去寻找吧）sunflower！smiling！\n[04:14.19]（绝不忘记）与你相遇的季节——\n';
	});

	it('parser should return false when rawLyric is empty', function() {
		expect(lyricParser('', undefined)).to.equal(false);
	});

	it('normal format lyric & translation parsing', function() {
		const res = lyricParser(this.normalLyric, this.normalTranslation);
		expect(res.lyric.length > 0).to.equal(true);
	});

	it('simplified lyric & timelined translation parsing', function() {
		const res = lyricParser(this.simplifiedLyric, this.timelinedTranslation);
		expect(res.lyric.length > 0).to.equal(true);
		expect(res.author).to.equal('KusunokiAsuha');
		expect(res.transAuthor).to.equal('ashuuuuuuu');
	});

});